//? 105. Что такое роутинг
//* - Роутинг - переключение между виртуальными "страницами" UI приложения
//* - Роутинг нужен чтобы упросить структуру приложения и организовать навигацию
//* - В Single Page Application страница одна и она не перезагружается

//? 106. Основы react-router
//* - React Router это не часть Реакт. Есть и другие библиотеки для роутинга, к примеру: UI-Router
// <Router>
//    <Route path="/путь-1" component={Отображемые Компонент-1 }/>
//    <Route path="/путь-2" component={Отображемые Компонент-2}/>
//    <Route path="/путь-3" component={Отображемые Компонент-3 }/>
// </Router>

//? 
//* - 
//* - 
//* - 

//? 
//* - 
//* - 
//* - 

//? 
//* - 
//* - 
//* - 